:: *********************************************************************************************
:: Добавление новой службы/кластера 1С:Предприятие на одном сервере
:: *********************************************************************************************
::
:: Для создания службы необходимо заполнить следующие поля: 
:: 1. Имя службы							- 1C_Server_21240 (Имя, которое появится в Компьютер\HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\)		
:: 2. Путь к платформе						- C:\Program Files\1cv8\8.3.18.1741\bin\ragent.exe
:: 3. Порт сервереа							- 21240
:: 4. Порт сервера							- 21241
:: 5. Порты сервера							- 21260:21291
:: 6. Папка для временных файлов			- C:\Program Files\1cv8\srvinfo21240
:: 7. Имя службы в диспетчере задач			- Агент сервера 1С:Предприятия 8.3 (21240)
:: 8. Имя пользователя для запуска службы 	- USR1CV8
:: 9. Пароль для пользователя из п.8		- XXXXXX
:: 
:: *********************************************************************************************
::
:: Если необходимо включить отладку, в конце строки после пароля добавляем -debug
:: Если необходимо включить отладку по HTTP, в конце строки после пароля добавляем -debug -http
::
:: *********************************************************************************************
:: 
:: Проверить созданную службу можно здесь:
:: Компьютер\HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\
::

sc create "1C_Server_21240" binPath= "\"C:\Program Files\1cv8\8.3.18.1741\bin\ragent.exe\" -srvc -agent -port 21240 -regport 21241 -range 21260:21291 -d \"C:\Program Files\1cv8\srvinfo21240"" start= auto displayname= "Агент сервера 1С:Предприятия 8.3 (21240)" obj= ".\USR1CV8" password= XXXXXX